{
  "PFDI-20": {
    "instructions": "Please answer all of the questions in the following survey. These questions will ask you if you have certain bowel, bladder, or pelvic symptoms and, if you do, how much they bother you. Answer these by selecting the appropriate number. While answering these questions, please consider your symptoms over the last 3 months. The PFDI-20 has 20 items and 3 scales of your symptoms. All items use the following format with a response scale from 0 to 4: 0 = Not present, 1 = Not at all, 2 = Somewhat, 3 = Moderately, 4 = Quite a bit.",
    
    "POPDI-6": {
      "questions": [
        {
          "id": 1,
          "question": "Do you usually experience pressure in the lower abdomen?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 2,
          "question": "Do you usually experience heaviness or dullness in the pelvic area?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 3,
          "question": "Do you usually have a bulge or something falling out that you can see or feel in your vaginal area?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 4,
          "question": "Do you ever have to push on the vagina or around the rectum to have or complete a bowel movement?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 5,
          "question": "Do you usually experience a feeling of incomplete bladder emptying?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 6,
          "question": "Do you ever have to push up on a bulge in the vaginal area with your fingers to start or complete urination?",
          "scale": [0, 1, 2, 3, 4]
        }
      ]
    },
    
    "CRADI-8": {
      "questions": [
        {
          "id": 7,
          "question": "Do you feel you need to strain too hard to have a bowel movement?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 8,
          "question": "Do you feel you have not completely emptied your bowels at the end of a bowel movement?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 9,
          "question": "Do you usually lose stool beyond your control if your stool is well-formed?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 10,
          "question": "Do you usually lose stool beyond your control if your stool is loose?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 11,
          "question": "Do you usually lose gas from the rectum beyond your control?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 12,
          "question": "Do you usually have pain when you pass your stool?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 13,
          "question": "Do you experience a strong sense of urgency and have to rush to the bathroom to have a bowel movement?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 14,
          "question": "Does part of your bowel ever pass through the rectum and bulge outside during or after a bowel movement?",
          "scale": [0, 1, 2, 3, 4]
        }
      ]
    },
    
    "UDI-6": {
      "questions": [
        {
          "id": 15,
          "question": "Do you usually experience frequent urination?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 16,
          "question": "Do you usually experience urine leakage associated with a feeling of urgency (i.e., a strong sensation of needing to go to the bathroom)?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 17,
          "question": "Do you usually experience urine leakage related to coughing, sneezing, or laughing?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 18,
          "question": "Do you usually experience small amounts of urine leakage (i.e., drops)?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 19,
          "question": "Do you usually experience difficulty emptying your bladder?",
          "scale": [0, 1, 2, 3, 4]
        },
        {
          "id": 20,
          "question": "Do you usually experience pain or discomfort in the lower abdomen or genital region?",
          "scale": [0, 1, 2, 3, 4]
        }
      ]
    },

    "scoring": {
      "scale_scores": "Obtain the mean value of all of the answered items within the corresponding scale (possible value 0 to 4) and multiply by 25 to obtain the scale score (range 0 to 100). Missing items are dealt with by using the mean from answered items only.",
      "summary_score": "Add the scores from the 3 scales together to obtain the summary score (range 0 to 300)."
    }
  }
}